# Задача # 1

# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік
# (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).

# Умова:

# якщо користувачу менше 7 - вивести повідомлення "Де твої батьки?"

# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"

# якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.

# якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"

# Рішення:

age = int(input("Please enter your age: "))

if age < 7:
    print("Where are your parents?")
elif age < 16:
    print("This is a movie for adults!")
elif age <= 65:
    print("Congratulations! Enjoy the movie.")
else:
    print("Show the pension certificate!")

# =====================================================================================================================

# Задача # 3

# Умова:

# Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт, а можуть бути в стр).
# Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат
# перемножений на три. якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.

#Рішення:

num1 = input("Enter the first number: ")
num2 = input("Enter the second number: ")

data_type = input("Do you want to treat the numbers as 'str' or 'int'? ")

if data_type == 'str':

    result = num1 + num2
else:

    result = int(num1) + int(num2)

result *= 3

print("Result:", result)

# =====================================================================================================================

#Задача # 2

#Умова

# Текстова: в чому різниця між is та == ?

#Відповідь

# оператор == перевіряє рівність значень двох об'єктів
# оператор is перевіряє ідентичність самих об'єктів.